package kz.codesmith.epay.loan.api.service.impl.excel;

public class ExcelConstants {

  public static final String[] ORDER_HEADERS = {"Номер заказа", "Статус", "Время заказа",
      "Вр.обновл.заказа", "ИИН", "Клиент", "Сумма займа", "Срок займа",
      "Продукт займа", "Дата рождения", "Пол", "Номер телефона", "Город", "Занятость",
      "Семейное положение", "Кол-во детей", "Еж.доход", "Еж.доп.доход", "КДН", "Долг",
      "Score", "Доход", "Новый КДН", "BadRate", "Просрочка", "Макс.сумма.платежа",
      "Макс.сумма.контракта", "Причина отказа", "Зарплата 1", "Зарплата 2", "Зарплата 3",
      "Зарплата 4", "Зарплата 5", "Зарплата 6"};
}
