package kz.codesmith.epay.loan.api.model.documents;

public class LoanDebtorFormPdfConstants {

  public static final String MFO_INFO = "ТОО «МФО Payintech»\n"
      + "Номер учетной регистрации в\n"
      + "реестре Национального Банка РК No02М20.017 от 19.10.2020г.\n"
      + "«МҚҰ Payintech» ЖШС 19.10.2020\n"
      + "жылғы ҚР Ұлттық Банкісі тізіліміндегі\n"
      + "Есептік тіркеунөмірі 02М20.017";

  public static final String HEADER = "АНКЕТА ЗАЕМЩИКА/ ҚАРЫЗ АЛУШЫНЫҢ САУАЛНАМАСЫ";

  public static final String CURRENT_DATE = "(Дата: %s)";

  public static final String TABLE_HEADER_COL1 = "Вопрос/ Сұрақ";

  public static final String TABLE_HEADER_COL2 = "Ответ/ Жауап";

  public static final String LOAN_PURPOSE = "Цель получения микрокредита/\n"
      + "Шағынкредит алу мақсаты";

  public static final String LOAN_SECURITY = "Наличие обеспечения по микрокредиту/\n"
      + "Шағын кредит бойынша кепілі";

  public static final String FIO = "ФИО (как в удостоверении личности)/\nТАӘ (жеке куәліктегі)";

  public static final String IIN = "ИИН/ ЖСН";

  public static final String BIRTHDATE = "Дата рождения/ Туған күні, айы, жылы";

  public static final String GENDER = "Пол/ Жынысы";

  public static final String ID_TYPE = "Тип документа удостоверяющего личность/\n"
      + "Жеке басты куәлендіретін құжаттың түрі";

  public static final String ID_INFO = "Номер документа удостоверяющего личность/\n"
      + "дата выдачи/ срок действия/\nорган выдавший документ/\n"
      + "Жеке басты куәлендіретін құжаттың нөмірі /\n"
      + "берілген күні/ әрекет ету мерзімі/\nқұжатты берген орган";

  public static final String MARITAL_STATUS = "Семейное положение/ Отбасылық жағдайы";

  public static final String NUMBER_OF_KIDS = "Количество несовершеннолетних детей\n"
      + "(совместнопроживающих)/\nКәмелетке толмағандар алалардың саны (бірге тұратын)";

  public static final String WORKPLACE = "Место работы/ Жұмыс орны";

  public static final String WORK_POSITION = "Должность/ Лауазымы";

  public static final String INCOME = "Доход/ Кірісі";

  public static final String NUMBER = "Номер телефона (мобильный, рабочий, домашний)/\n"
      + "Телефон (мобильді, жұмыс, үй) нөмірі";

  public static final String EMAIL = "Электронный адрес/\nЭлектрондық мекен-жай";

  public static final String ADDRESS = "Адрес проживания/\nТұрғылықты мекен-жайы";

  public static final String LOAN_METHOD = "Способ получения микрокредита/\n"
      + "Микрокредитті алу тәсілі";

  public static final String SIGNATURE =
      "(ФИО полностью, подпись / Толық аты-жөні, қолы)\t________________________________";

  public static final String ANNOTATIONS_RU = "1. Принятие МФО данной Анкеты к рассмотрению "
      + "не является обязательством МФО предоставить Микрокредит.\n"
      + "2. Все сведения, содержащиеся в настоящей Анкете, "
      + "предоставлены исключительно для получения Микрокредита.\n"
      + "3. МФО оставляет за собой право проверки достоверности и полноты любой сообщаемой "
      + "Клиентом о себе информации, а информация предоставленная Клиентом может храниться в "
      + "МФО, даже если Микрокредит не будет предоставлен.\n"
      + "4. С Правилами предоставления микрокредитов МФО, текстом договора о предоставлении "
      + "микрокредита я ознакомлен, возражений не имею.\n"
      + "5. Подтверждаю, что я был ознакомлен с аннуитетным и дифференцированным методами "
      + "погашения микрокредита и выбрал метод %s.\n"
      + "6. Подтверждаю, что был ознакомлен со своими правами и обязанностями, связанными с "
      + "получением микрокредита, перечисленными в Правилах предоставления микрокредитов МФО.\n"
      + "7. Подтверждаю, что сведения, содержащиеся в настоящей Анкете, являются полными и "
      + "достоверными на дату их предоставления МФО. Осознаю и принимаю ответственность за "
      + "предоставленные данные.";

  public static final String ANNOTATIONS_KZ = "1. МҚҰ осы сауалнаманы қарауға қабылдауы - "
      + "МКҰ Микрокредитті беру міндеттемесі болып табылмайды.\n"
      + "2. Осы сауалнамадағы барлық мәліметтер тек Микрокредитті алу мақсатында беріледі.\n"
      + "3. МҚҰ Клиентке өзі туралы хабарланып жатқан ақпараттың дұрыстығы мен толықтығын тексеру "
      + "құқығын өзіне қалдырады және Клиентпен берілген ақпарат Микрокредит "
      + "берілмейтін болса да, МҚҰ-да сақтала алады.\n"
      + "4. МҚҰ-ның микредиттерді беру ережесімен, микрокредитті беру туралы шарттың мәтінімен "
      + "таныстым, қарсылығым жоқ.\n"
      + "5. Мен микрокредитті өтеудің аннуитетті және сараланған әдістерімен танысқанымды "
      + "және %s төлемдер әдісін таңдағанымды растаймын.\n"
      + "6. МҚҰ микрокредиттер беру ережесінде көрсетілген микрокредит алуға байланысты өз "
      + "құқықтарыммен және міндеттеріммен танысқанымды растаймын.\n"
      + "7. Осы сауалнамадағы мәліметтердің МҚҰ берген күні толық және дұрыс болғанын растаймын. "
      + "Берілген деректерге жауапкершілікті сезінемін және қабылдаймын";
}
